a = 'Шляпка гриба, покрытая … кожиц..й, держится на … ножк.. . Снизу шляпка затянута … плёнкой. Когда её уберёшь, откроется нижняя … сторона шляпк.. .'

a = str(input('покрытая … '))
b = str(input('кожиц..й '))
c = str(input('на … '))
d = str(input('ножк.. '))
e = str(input('затянута … '))
f = str(input('нижняя … '))
g = str(input('шляпк.. '))

print(f'Шляпка гриба, покрытая {a} кожиц{b}й, держится на {c} ножк{d}. Снизу шляпка затянута {e} плёнкой. Когда её уберёшь, откроется нижняя {f} сторона шляпк{g}.')